# PANDAS LEARNING

In [1]:
import numpy as np            
import pandas as pd             #np, pd are aliaces

In [57]:
s1=pd.Series([1,2,3,4,5])

In [58]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [4]:
s2=pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
pd.Series({'a':10, 'b':20, "c": 30})

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series({'a':10, 'b':20, "c": 30}, 
          index=['b','c','d','a'])

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

## Extract individual elements

In [7]:
s1=pd.Series([1,2,3,4,5,6,7,8,9])
s1[3]   #for single element

4

In [8]:
s1[-3:]     #from back

6    7
7    8
8    9
dtype: int64

In [9]:
s1[:4]     #sequence of elements

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
s1+5         #adding value

0     6
1     7
2     8
3     9
4    10
5    11
6    12
7    13
8    14
dtype: int64

In [11]:
s1 = pd.Series([1,2,3,4,5,6,7,8,10,20])
s2 = pd.Series([10,20,30,40,50,60,70,80,100,200])

In [12]:
s1+s2

0     11
1     22
2     33
3     44
4     55
5     66
6     77
7     88
8    110
9    220
dtype: int64

In [13]:
dict1={
    "name":['Subham', 'Akash', 'Rajesh', 'Anmol'],
    "city":['Kolkata', 'UP', 'MP', 'Mumbai'],
    "gpa" : [8, 6, 7.5, 9],
    "cgpa" :[7.5, 5.5, 6.5, 8.5]
}

In [14]:
dict1

{'name': ['Subham', 'Akash', 'Rajesh', 'Anmol'],
 'city': ['Kolkata', 'UP', 'MP', 'Mumbai'],
 'gpa': [8, 6, 7.5, 9],
 'cgpa': [7.5, 5.5, 6.5, 8.5]}

In [15]:
df=pd.DataFrame(dict1)

In [16]:
df

     name     city  gpa  cgpa
0  Subham  Kolkata  8.0   7.5
1   Akash       UP  6.0   5.5
2  Rajesh       MP  7.5   6.5
3   Anmol   Mumbai  9.0   8.5

In [17]:
df.to_csv('friends.csv')

In [18]:
df.to_csv('friends_index_false.csv', index=False)

In [62]:
df.head(2)

     name     city  gpa  cgpa
0  Subham  Kolkata  8.0   7.5
1   Akash       UP  6.0   5.5

In [20]:
df.tail(2)

     name    city  gpa  cgpa
2  Rajesh      MP  7.5   6.5
3   Anmol  Mumbai  9.0   8.5

In [21]:
df.describe()

         gpa      cgpa
count  4.000  4.000000
mean   7.625  7.000000
std    1.250  1.290994
min    6.000  5.500000
25%    7.125  6.250000
50%    7.750  7.000000
75%    8.250  7.750000
max    9.000  8.500000

In [22]:
df.shape

(4, 4)

In [23]:
df

     name     city  gpa  cgpa
0  Subham  Kolkata  8.0   7.5
1   Akash       UP  6.0   5.5
2  Rajesh       MP  7.5   6.5
3   Anmol   Mumbai  9.0   8.5

In [24]:
df

     name     city  gpa  cgpa
0  Subham  Kolkata  8.0   7.5
1   Akash       UP  6.0   5.5
2  Rajesh       MP  7.5   6.5
3   Anmol   Mumbai  9.0   8.5

In [25]:
df.iloc[0,2]

8.0

In [26]:
df.iloc [1:3,1:]

  city  gpa  cgpa
1   UP  6.0   5.5
2   MP  7.5   6.5

In [27]:
y = df[['cgpa']]

In [28]:
x = df[['gpa']]

In [29]:
iris=pd.read_csv('Iris.csv')

In [30]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [31]:
iris.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [32]:
iris.shape

(150, 6)

In [33]:
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [34]:
iris.iloc[0:3,0:2]  #extract 1st 2 row and col using index no.

   Id  SepalLengthCm
0   1            5.1
1   2            4.9
2   3            4.7

In [35]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [36]:
iris.iloc[5:11,2:]

    SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
5            3.9            1.7           0.4  Iris-setosa
6            3.4            1.4           0.3  Iris-setosa
7            3.4            1.5           0.2  Iris-setosa
8            2.9            1.4           0.2  Iris-setosa
9            3.1            1.5           0.1  Iris-setosa
10           3.7            1.5           0.2  Iris-setosa

In [37]:
iris.loc[1:5,("PetalLengthCm","Species")]

   PetalLengthCm      Species
1            1.4  Iris-setosa
2            1.3  Iris-setosa
3            1.5  Iris-setosa
4            1.4  Iris-setosa
5            1.7  Iris-setosa

In [38]:
iris.drop("Species",axis=1)

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
0      1            5.1           3.5            1.4           0.2
1      2            4.9           3.0            1.4           0.2
2      3            4.7           3.2            1.3           0.2
3      4            4.6           3.1            1.5           0.2
4      5            5.0           3.6            1.4           0.2
..   ...            ...           ...            ...           ...
145  146            6.7           3.0            5.2           2.3
146  147            6.3           2.5            5.0           1.9
147  148            6.5           3.0            5.2           2.0
148  149            6.2           3.4            5.4           2.3
149  150            5.9           3.0            5.1           1.8

[150 rows x 5 columns]

In [39]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [40]:
i1=iris.drop([5,6,7],axis=0)

In [41]:
i1.head(10)

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0    1            5.1           3.5            1.4           0.2  Iris-setosa
1    2            4.9           3.0            1.4           0.2  Iris-setosa
2    3            4.7           3.2            1.3           0.2  Iris-setosa
3    4            4.6           3.1            1.5           0.2  Iris-setosa
4    5            5.0           3.6            1.4           0.2  Iris-setosa
8    9            4.4           2.9            1.4           0.2  Iris-setosa
9   10            4.9           3.1            1.5           0.1  Iris-setosa
10  11            5.4           3.7            1.5           0.2  Iris-setosa
11  12            4.8           3.4            1.6           0.2  Iris-setosa
12  13            4.8           3.0            1.4           0.1  Iris-setosa

In [42]:
iris.mean()

Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64

In [43]:
iris.min()

Id                         1
SepalLengthCm            4.3
SepalWidthCm             2.0
PetalLengthCm            1.0
PetalWidthCm             0.1
Species          Iris-setosa
dtype: object

In [44]:
iris.median()

Id               75.50
SepalLengthCm     5.80
SepalWidthCm      3.00
PetalLengthCm     4.35
PetalWidthCm      1.30
dtype: float64

In [45]:
iris.max()

Id                          150
SepalLengthCm               7.9
SepalWidthCm                4.4
PetalLengthCm               6.9
PetalWidthCm                2.5
Species          Iris-virginica
dtype: object

In [46]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [47]:
def double_make(s):         #create user defind method
    return s*2

In [48]:
iris[['SepalWidthCm','PetalWidthCm']].apply(double_make)  # value sqaure

     SepalWidthCm  PetalWidthCm
0             7.0           0.4
1             6.0           0.4
2             6.4           0.4
3             6.2           0.4
4             7.2           0.4
..            ...           ...
145           6.0           4.6
146           5.0           3.8
147           6.0           4.0
148           6.8           4.6
149           6.0           3.6

[150 rows x 2 columns]

In [49]:
iris['Species'].value_counts()    #for value count

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

In [50]:
iris.sort_values(by='SepalLengthCm')    #for col sort

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
13,14,4.3,3.0,1.1,0.1,Iris-setosa
42,43,4.4,3.2,1.3,0.2,Iris-setosa
38,39,4.4,3.0,1.3,0.2,Iris-setosa
8,9,4.4,2.9,1.4,0.2,Iris-setosa
41,42,4.5,2.3,1.3,0.3,Iris-setosa
...,...,...,...,...,...,...
122,123,7.7,2.8,6.7,2.0,Iris-virginica
118,119,7.7,2.6,6.9,2.3,Iris-virginica
117,118,7.7,3.8,6.7,2.2,Iris-virginica
135,136,7.7,3.0,6.1,2.3,Iris-virginica
131,132,7.9,3.8,6.4,2.0,Iris-virginica